#include "stemming.h"

QString Stemming::getStemmedForm(const QString &word)
{
    if (STOP_WORD.contains(word))
        return "";

    QRegExp reg(VOWER);

    int index = reg.indexIn(word) + 1;
    if (index == 0)
        return "";

    QString rv = word.mid(index);
    QString pre = word.left(index);


    if (!(removeEndingWord(rv, PERFECTIVE_1, true) || removeEndingWord(rv, PERFECTIVE_2)))
        removeEndingWord(rv, REFLEXIVE);

    if (!(removeEndingWord(rv, ADJECTIVE) || removeEndingWord(rv, ADJECTIVAL_1, true)
          || removeEndingWord(rv, ADJECTIVAL_2)))
        if (!(removeEndingWord(rv, VERB_1, true) || removeEndingWord(rv, VERB_2)))
                removeEndingWord(rv, NOUN);


    if (rv.indexOf("и", rv.size() - 1) != -1)
        rv = rv.remove(rv.size() - 1, 1);

    reg.setPattern(VOWER + "\\w");
    index = reg.indexIn(rv);
    QString r2 = rv.mid(index + 2);

    if (removeEndingWord(r2, DERIVATIONAL))
        removeEndingWord(rv, DERIVATIONAL);

    if (rv.indexOf("нн", rv.size() - 2) != -1)
        rv = rv.remove(rv.size() - 2, 2);

    removeEndingWord(rv, SUPERLATIVE);

    if (rv.indexOf("нн", rv.size() - 2) != -1)
        rv = rv.remove(rv.size() - 2, 2);

    if (rv.indexOf("ь", rv.size() - 1) != -1)
        rv = rv.remove(rv.size() - 1, 1);


    return pre + rv;
}


bool Stemming::removeEndingWord(QString &word, const QVector<QString> category, bool inGroup)
{
    int maxLenght = 0;
    for (const auto& var : category) {
        if (word.size() - var.size() - 1 >= 0)
            if ((word.indexOf(var, word.size() - var.size()) != -1)
                    && (maxLenght < var.size())
                    && (!inGroup || word[word.size() - var.size() - 1] == "а"
                                 || word[word.size() - var.size() - 1] == "я"))
                maxLenght = var.size();
    }
    if (maxLenght) {
        word.remove(word.size() - maxLenght, maxLenght);
        return true;
    }
    return false;
}
const QSet<QString> Stemming::STOP_WORD = {"а", "будем", "будет", "будете", "будешь", "буду", "будут", "будучи",
                                              "будь", "будьте", "бы", "был", "была", "были", "было", "быть",
                                              "в", "вам", "вами", "вас", "весь", "во", "вот", "все",
                                              "всё", "всего", "всей", "всем", "всём", "всеми", "всему", "всех",
                                              "всею", "всея", "всю", "вся", "вы", "да", "для", "до",
                                              "его", "едим", "едят", "ее", "её", "ей", "ел", "ела",
                                              "ем", "ему", "емъ", "если", "ест", "есть", "ешь", "еще",
                                              "ещё", "ею", "же", "за", "и", "из", "или", "им",
                                              "ими", "имъ", "их", "к", "как", "кем", "ко", "когда",
                                              "кого", "ком", "кому", "комья", "которая", "которого",
                                              "которое", "которой", "котором", "которому", "которою",
                                              "которую", "которые", "который", "которым", "которыми",
                                              "которых", "кто", "меня", "мне", "мной", "мною", "мог", "моги",
                                              "могите", "могла", "могли", "могло", "могу", "могут", "мое", "моё",
                                              "моего", "моей", "моем", "моём", "моему", "моею", "можем", "может",
                                              "можете", "можешь", "мои", "мой", "моим", "моими", "моих", "мочь",
                                              "мою", "моя", "мы", "на", "нам", "нами", "нас", "наса",
                                              "наш", "наша", "наше", "нашего", "нашей", "нашем", "нашему", "нашею",
                                              "наши", "нашим", "нашими", "наших", "нашу", "не", "него", "нее",
                                              "неё", "ней", "нем", "нём", "нему", "нет", "нею", "ним",
                                              "ними", "них", "но", "о", "об", "один", "одна", "одни",
                                              "одним", "одними", "одних", "одно", "одного", "одной", "одном", "одному",
                                              "одною", "одну", "он", "она", "оне", "они", "оно", "от",
                                              "по", "при", "с", "сам", "сама", "сами", "самим", "самими",
                                              "самих", "само", "самого", "самом", "самому", "саму", "свое", "своё",
                                              "своего", "своей", "своем", "своём", "своему", "своею", "свои", "свой",
                                              "своим", "своими", "своих", "свою", "своя", "себе", "себя", "собой",
                                              "собою", "та", "так", "такая", "такие", "таким", "такими", "таких",
                                              "такого", "такое", "такой", "таком", "такому", "такою", "такую", "те",
                                              "тебе", "тебя", "тем", "теми", "тех", "то", "тобой", "тобою",
                                              "того", "той", "только", "том", "томах", "тому", "тот", "тою",
                                              "ту", "ты", "у", "уже", "чего", "чем", "чём", "чему",
                                              "что", "чтобы", "эта", "эти", "этим", "этими", "этих", "это",
                                              "этого", "этой", "этом", "этому", "этот", "этою", "эту", "я"};
const QString Stemming::VOWER = "[аеиоуыэюя]";
const QVector<QString> Stemming::PERFECTIVE_1 = {"в", "вши", "вшись"};
const QVector<QString> Stemming::PERFECTIVE_2 = {"ив", "ивши", "ившись", "ыв", "ывши", "ывшись"};
const QVector<QString> Stemming::ADJECTIVE = {"ее", "ие", "ые", "ое", "ими", "ыми", "ей", "ий",
                                 "ый", "ой", "ем", "им", "ым", "ом", "его", "ого",
                                 "ему", "ому", "их", "ых", "ую", "юю", "ая", "яя", "ою", "ею"};
const QVector<QString> Stemming::PARTICIPLE_1 = {"ем", "нн", "вш", "ющ", "щ"};
const QVector<QString> Stemming::PARTICIPLE_2 = {"ивш", "ывш", "ующ"};
const QVector<QString> Stemming::ADJECTIVAL_1 = {"емее", "ннее", "вшее", "ющее", "щее",
                                              "емие", "нние", "вшие", "ющие", "щие",
                                              "емые", "нные", "вшые", "ющые", "щые",
                                              "емое", "нное", "вшое", "ющое", "щое",
                                              "емими", "нними", "вшими", "ющими", "щими",
                                              "емыми", "нными", "вшыми", "ющыми", "щыми",
                                              "емей", "нней", "вшей", "ющей", "щей",
                                              "емий", "нний", "вший", "ющий", "щий",
                                              "емый", "нный", "вшый", "ющый", "щый",
                                              "емой", "нной", "вшой", "ющой", "щой",
                                              "емем", "ннем", "вшем", "ющем", "щем",
                                              "емим", "нним", "вшим", "ющим", "щим",
                                              "емым", "нным", "вшым", "ющым", "щым",
                                              "емом", "нном", "вшом", "ющом", "щом",
                                              "емего", "ннего", "вшего", "ющего", "щего",
                                              "емого", "нного", "вшого", "ющого", "щого",
                                              "емему", "ннему", "вшему", "ющему", "щему",
                                              "емому", "нному", "вшому", "ющому", "щому",
                                              "емих", "нних", "вших", "ющих", "щих",
                                              "емых", "нных", "вшых", "ющых", "щых",
                                              "емую", "нную", "вшую", "ющую", "щую",
                                              "емюю", "ннюю", "вшюю", "ющюю", "щюю",
                                              "емая", "нная", "вшая", "ющая", "щая",
                                              "емяя", "нняя", "вшяя", "ющяя", "щяя",
                                              "емою", "нною", "вшою", "ющою", "щою",
                                              "емею", "ннею", "вшею", "ющею", "щею"};
const QVector<QString> Stemming::ADJECTIVAL_2 = {"ившее", "ывшее", "ующее",
                                              "ившие", "ывшие", "ующие",
                                              "ившые", "ывшые", "ующые",
                                              "ившое", "ывшое", "ующое",
                                              "ившими", "ывшими", "ующими",
                                              "ившыми", "ывшыми", "ующыми",
                                              "ившей", "ывшей", "ующей",
                                              "ивший", "ывший", "ующий",
                                              "ившый", "ывшый", "ующый",
                                              "ившой", "ывшой", "ующой",
                                              "ившем", "ывшем", "ующем",
                                              "ившим", "ывшим", "ующим",
                                              "ившым", "ывшым", "ующым",
                                              "ившом", "ывшом", "ующом",
                                              "ившего", "ывшего", "ующего",
                                              "ившого", "ывшого", "ующого",
                                              "ившему", "ывшему", "ующему",
                                              "ившому", "ывшому", "ующому",
                                              "ивших", "ывших", "ующих",
                                              "ившых", "ывшых", "ующых",
                                              "ившую", "ывшую", "ующую",
                                              "ившюю", "ывшюю", "ующюю",
                                              "ившая", "ывшая", "ующая",
                                              "ившяя", "ывшяя", "ующяя",
                                              "ившою", "ывшою", "ующою",
                                              "ившею", "ывшею", "ующею"};
const QVector<QString> Stemming::REFLEXIVE = {"ся", "сь"};
const QVector<QString> Stemming::VERB_1 = {"ла", "на", "ете", "йте", "ли", "й", "л", "ем", "н", "ло", "но",
                                        "ет", "ют", "ны", "ть", "ешь", "нно"};
const QVector<QString> Stemming::VERB_2 = {"ила", "ыла", "ена", "ейте", "уйте", "ите", "или", "ыли", "ей", "уй", "ил",
                                        "ыл", "им", "ым", "ен", "ило", "ыло", "ено", "ят",
                                        "ует", "уют", "ит", "ыт", "ены", "ить", "ыть",
                                        "ишь", "ую", "ю"};
const QVector<QString> Stemming::NOUN = {"а", "ев", "ов", "ие", "ье", "е", "иями", "ями", "ами", "еи", "ии", "и", "ией", "ей",
                             "ой", "ий", "й", "иям", "ям", "ием", "ем", "ам", "ом", "о", "у", "ах",
                             "иях", "ях", "ы", "ь", "ию", "ью", "ю", "ия", "ья", "я"};
const QVector<QString> Stemming::SUPERLATIVE = {"ейш", "ейше"};
const QVector<QString> Stemming::DERIVATIONAL = {"ост", "ость"};

